spec/fixtures/stripe_charge_success.json

{
  "livemode": false,
  "fee": 0,
  "invoice": null,
  "paid": true,
  "amount": 400,
  "disputed": false,
  "card": {
    "address_line1": null,
    "type": "Visa",
    "address_line2": null,
    "cvc_check": null,
    "address_country": null,
    "address_zip_check": null,
    "address_state": null,
    "country": "US",
    "exp_month": 8,
    "object": "card",
    "address_line1_check": null,
    "name": null,
    "fingerprint": "yUCTMrO7dARaNeJD",
    "exp_year": 2013,
    "address_zip": null,
    "id": "cc_xBwgnUpd4QcrpV",
    "last4": "4242"
  },
  "created": 1334596818,
  "refunded": false,
  "object": "charge",
  "amount_refunded": 0,
  "failure_message": null,
  "id": "ch_PZ6XmVZB8xthjd",
  "currency": "usd",
  "customer": null,
  "description": "Charge for mchlipala@gmail.com"
}